Revit 2027 API
BuiltInFailures.SketchFailures.BadNosingProfile Property
 Stairs nosing profile must have one loop. Wrong profile will not be shown in profiles list in Stairs Type properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadNosingProfile { get; }
Public Shared ReadOnly Property BadNosingProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadNosingProfile {
	FailureDefinitionId^ get ();
}
static member BadNosingProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace